Revit 2027 API
IndexStreamTriangle.AddTriangle Method
 Inserts a IndexTriangle into the stream and associated buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddTriangle(
	IndexTriangle triangle
)
Public Sub AddTriangle (
	triangle As IndexTriangle
)
public:
void AddTriangle(
	IndexTriangle^ triangle
)
member AddTriangle :
        triangle : IndexTriangle -> unit
Parameters
triangle IndexTriangle
 The triangle to be inserted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
See Also
Reference
IndexStreamTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace